Revit 2027 API
View3D.CanResetCameraTarget Method
 Checks whether the camera target can be reset for this view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanResetCameraTarget()
Public Function CanResetCameraTarget As Boolean
public:
bool CanResetCameraTarget()
member CanResetCameraTarget : unit -> bool
Return Value
Boolean
 True if camera target can be reset for this view, false otherwise.
Remarks
 The camera target can only be reset for perspective view.
See Also
Reference
View3D Class
Autodesk.Revit.DB Namespace